План_полетов_файловый_edt/src/Documents/УстановкаСкидок/УстановкаСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидок</name>
  <registerRecords>InformationRegister.Скидки</registerRecords>
  <attributes>
    <name>Авиакомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РейсОтправления</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействителенДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ИностранныйВС</name>
      <comment>Ложь - российский владелец ВС, истина - иностранный</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

План_полетов_файловый_edt/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействителенДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИностранныйВС</name>
    <comment>Ложь - российский владелец ВС, истина - иностранный</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Авиакомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РейсОтправления</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

План_полетов_файловый_edt/src/Documents/УстановкаСкидок/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Скидки.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.Скидки.Добавить();
		Движение.Период = Дата;
		Движение.Услуга = ТекСтрокаУслуги.Услуга;
		Движение.ИностранныйВС = ТекСтрокаУслуги.ИностранныйВС;
		Движение.Авиакомпания = Авиакомпания;
		Движение.РейсОтправления = РейсОтправления;
		Движение.Процент = ТекСтрокаУслуги.Скидка;
		Движение.Основание = Основание;
		Движение.ДействителенДо = ДействителенДо;
	КонецЦикла;
КонецПроцедуры
